<a href="https://colab.research.google.com/github/thihanaung-thnn/notes_Python/blob/main/notes_jose_portilla_lectures/machine_learning_with_python/02_pandas_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

## Series
- Series is similar to NumPy array.

In [39]:
import numpy as np
import pandas as pd

In [40]:
index = ['First','Second','Third']
data = [22,33,44]
pd.Series(data = data, index = index)

First     22
Second    33
Third     44
dtype: int64

In [41]:
rand_data = np.random.randint(0,100,5)
names = ['Chou','Saber','Franco','Angela','Myia']
power = pd.Series(rand_data, names)
power # names are indices.

Chou      77
Saber     74
Franco    73
Angela    75
Myia      52
dtype: int64

In [42]:
# from dictionary
ages = {'Tim':22, 'John':33, 'Rose':22}
pds = pd.Series(ages)
pds

Tim     22
John    33
Rose    22
dtype: int64

In [43]:
type(pds)

pandas.core.series.Series

In [44]:
# named index 
# same as indexing with list or dictionaries
pds['Tim']

22

In [45]:
pds[0]

22

In [46]:
# Operations
pds.keys()

Index(['Tim', 'John', 'Rose'], dtype='object')

In [47]:
pds*10

Tim     220
John    330
Rose    220
dtype: int64

In [48]:
pds/2

Tim     11.0
John    16.5
Rose    11.0
dtype: float64

In [49]:
pds * pds

Tim      484
John    1089
Rose     484
dtype: int64

## DataFrames
- DataFrame consists of multiple Pandas Series that share index values

### Creating DataFrame

In [50]:
# help(pd.DataFrame)
np.random.seed(13)
data = np.random.randint(0,101, (4,3))
data

array([[82, 48, 74],
       [16, 98, 25],
       [58, 99, 26],
       [66, 46, 54]])

In [51]:
names = ['Tigeral','Minotour','Johnson','Uranus']
col = ['Str','Int','Att']
pd.DataFrame(data=data)

    0   1   2
0  82  48  74
1  16  98  25
2  58  99  26
3  66  46  54

In [52]:
df = pd.DataFrame(data = data, index=names, columns = col)
df

          Str  Int  Att
Tigeral    82   48   74
Minotour   16   98   25
Johnson    58   99   26
Uranus     66   46   54

### Glimpsing DataFrame

In [53]:
data = pd.read_csv('sample_data/california_housing_train.csv')
df = data.copy()
df = df.iloc[0:100]

In [54]:
df.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [55]:
df.index

RangeIndex(start=0, stop=100, step=1)

In [56]:
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [57]:
df.tail(3)

    longitude  latitude  ...  median_income  median_house_value
97    -115.58     32.79  ...         1.6635             64400.0
98    -115.58     32.78  ...         5.7843            110100.0
99    -115.59     32.85  ...         4.8750             90800.0

[3 rows x 9 columns]

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           100 non-null    float64
 1   latitude            100 non-null    float64
 2   housing_median_age  100 non-null    float64
 3   total_rooms         100 non-null    float64
 4   total_bedrooms      100 non-null    float64
 5   population          100 non-null    float64
 6   households          100 non-null    float64
 7   median_income       100 non-null    float64
 8   median_house_value  100 non-null    float64
dtypes: float64(9)
memory usage: 7.2 KB

In [59]:
len(df)

100

In [60]:
df.describe()

        longitude    latitude  ...  median_income  median_house_value
count  100.000000  100.000000  ...     100.000000          100.000000
mean  -115.299100   33.144100  ...       2.462202        72825.000000
std      0.389058    0.597297  ...       1.168484        22706.232736
min   -115.590000   32.670000  ...       0.857100        25000.000000
25%   -115.550000   32.790000  ...       1.648050        60550.000000
50%   -115.515000   32.845000  ...       2.107300        68850.000000
75%   -115.295000   33.287500  ...       3.196200        84950.000000
max   -114.310000   34.910000  ...       6.271500       146300.000000

[8 rows x 9 columns]

In [61]:
df.describe().transpose()

                    count          mean  ...         75%          max
longitude           100.0   -115.299100  ...   -115.2950    -114.3100
latitude            100.0     33.144100  ...     33.2875      34.9100
housing_median_age  100.0     23.160000  ...     30.0000      48.0000
total_rooms         100.0   1677.850000  ...   1989.7500    7650.0000
total_bedrooms      100.0    376.220000  ...    443.5000    1901.0000
population          100.0   1077.710000  ...   1314.0000    3565.0000
households          100.0    323.590000  ...    412.7500    1056.0000
median_income       100.0      2.462202  ...      3.1962       6.2715
median_house_value  100.0  72825.000000  ...  84950.0000  146300.0000

[9 rows x 8 columns]

### Selection and Indexing

In [62]:
# columnns - single column
df['population']

0     1015.0
1     1129.0
2      333.0
3      515.0
4      624.0
       ...
95     458.0
96     533.0
97     762.0
98    1416.0
99     862.0
Name: population, Length: 100, dtype: float64

In [63]:
type(df['population'])

pandas.core.series.Series

In [64]:
# multiple columns
df[['population','households']]

    population  households
0       1015.0       472.0
1       1129.0       463.0
2        333.0       117.0
3        515.0       226.0
4        624.0       262.0
..         ...         ...
95       458.0       143.0
96       533.0       201.0
97       762.0       451.0
98      1416.0       421.0
99       862.0       248.0

[100 rows x 2 columns]

In [65]:
# adding new columns 
df['new_column'] = df['population']/df['households']
df['new_column'] = np.round(df['new_column'], 2)
df.head()

   longitude  latitude  ...  median_house_value  new_column
0    -114.31     34.19  ...             66900.0        2.15
1    -114.47     34.40  ...             80100.0        2.44
2    -114.56     33.69  ...             85700.0        2.85
3    -114.57     33.64  ...             73400.0        2.28
4    -114.57     33.57  ...             65500.0        2.38

[5 rows x 10 columns]

In [66]:
# remove column 
df = df.drop('new_column', axis = 1)
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

### Indexing

In [67]:
df['rand_col'] = np.arange(len(df))
df['rand_col'] = ['A' + str(i) for i in df['rand_col']]
df.head()

   longitude  latitude  ...  median_house_value  rand_col
0    -114.31     34.19  ...             66900.0        A0
1    -114.47     34.40  ...             80100.0        A1
2    -114.56     33.69  ...             85700.0        A2
3    -114.57     33.64  ...             73400.0        A3
4    -114.57     33.57  ...             65500.0        A4

[5 rows x 10 columns]

In [68]:
df.index

RangeIndex(start=0, stop=100, step=1)

In [69]:
df = df.set_index('rand_col')
df.head()

          longitude  latitude  ...  median_income  median_house_value
rand_col                       ...
A0          -114.31     34.19  ...         1.4936             66900.0
A1          -114.47     34.40  ...         1.8200             80100.0
A2          -114.56     33.69  ...         1.6509             85700.0
A3          -114.57     33.64  ...         3.1917             73400.0
A4          -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [70]:
# select single row
# integer based
df.iloc[0]

longitude              -114.3100
latitude                 34.1900
housing_median_age       15.0000
total_rooms            5612.0000
total_bedrooms         1283.0000
population             1015.0000
households              472.0000
median_income             1.4936
median_house_value    66900.0000
Name: A0, dtype: float64

In [71]:
# index name based
df.loc['A1']

longitude              -114.47
latitude                 34.40
housing_median_age       19.00
total_rooms            7650.00
total_bedrooms         1901.00
population             1129.00
households              463.00
median_income             1.82
median_house_value    80100.00
Name: A1, dtype: float64

In [72]:
# multiple rows
df.iloc[0:3]

          longitude  latitude  ...  median_income  median_house_value
rand_col                       ...
A0          -114.31     34.19  ...         1.4936             66900.0
A1          -114.47     34.40  ...         1.8200             80100.0
A2          -114.56     33.69  ...         1.6509             85700.0

[3 rows x 9 columns]

In [73]:
df.loc[['A1','A3']]

          longitude  latitude  ...  median_income  median_house_value
rand_col                       ...
A1          -114.47     34.40  ...         1.8200             80100.0
A3          -114.57     33.64  ...         3.1917             73400.0

[2 rows x 9 columns]

In [74]:
# remove rows
df.drop('A0', axis=0).head()
# error if use index

          longitude  latitude  ...  median_income  median_house_value
rand_col                       ...
A1          -114.47     34.40  ...         1.8200             80100.0
A2          -114.56     33.69  ...         1.6509             85700.0
A3          -114.57     33.64  ...         3.1917             73400.0
A4          -114.57     33.57  ...         1.9250             65500.0
A5          -114.58     33.63  ...         3.3438             74000.0

[5 rows x 9 columns]

In [75]:
# append row
one_row = df.iloc[0]
df.append(one_row).tail()

          longitude  latitude  ...  median_income  median_house_value
rand_col                       ...
A96         -115.58     32.81  ...         3.6597             87500.0
A97         -115.58     32.79  ...         1.6635             64400.0
A98         -115.58     32.78  ...         5.7843            110100.0
A99         -115.59     32.85  ...         4.8750             90800.0
A0          -114.31     34.19  ...         1.4936             66900.0

[5 rows x 9 columns]

## Conditional Filtering

In [79]:
df = pd.read_csv('sample_data/tips.csv')

In [80]:
df.head()

   total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0       16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1       10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2       21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3       23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4       24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251

[5 rows x 11 columns]

In [86]:
bool_series = df['total_bill'] > 45
bool_series

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Name: total_bill, Length: 244, dtype: bool

In [87]:
df[bool_series]

     total_bill    tip   sex  ...       Payer Name         CC Number Payment ID
59        48.27   6.73  Male  ...      Brian Ortiz  6596453823950595    Sat8139
156       48.17   5.00  Male  ...    Ryan Gonzales  3523151482063321    Sun7518
170       50.81  10.00  Male  ...    Gregory Clark  5473850968388236    Sat1954
182       45.35   3.50  Male  ...     Jose Parsons  4112207559459910    Sun2337
212       48.33   9.00  Male  ...  Alex Williamson      676218815212    Sat4590

[5 rows x 11 columns]

In [88]:
df[df['total_bill'] > 45]

     total_bill    tip   sex  ...       Payer Name         CC Number Payment ID
59        48.27   6.73  Male  ...      Brian Ortiz  6596453823950595    Sat8139
156       48.17   5.00  Male  ...    Ryan Gonzales  3523151482063321    Sun7518
170       50.81  10.00  Male  ...    Gregory Clark  5473850968388236    Sat1954
182       45.35   3.50  Male  ...     Jose Parsons  4112207559459910    Sun2337
212       48.33   9.00  Male  ...  Alex Williamson      676218815212    Sat4590

[5 rows x 11 columns]

In [91]:
# multiple conditions
df[(df['total_bill'] > 45) & (df['smoker'] == 'Yes')]

     total_bill   tip   sex  ...     Payer Name         CC Number Payment ID
170       50.81  10.0  Male  ...  Gregory Clark  5473850968388236    Sat1954
182       45.35   3.5  Male  ...   Jose Parsons  4112207559459910    Sun2337

[2 rows x 11 columns]

In [92]:
df[(df['total_bill'] > 45) & ~(df['smoker'] == 'Yes')] # or (df['smoker'] != 'Yes')
# and -> &, or -> |

     total_bill   tip   sex  ...       Payer Name         CC Number Payment ID
59        48.27  6.73  Male  ...      Brian Ortiz  6596453823950595    Sat8139
156       48.17  5.00  Male  ...    Ryan Gonzales  3523151482063321    Sun7518
212       48.33  9.00  Male  ...  Alex Williamson      676218815212    Sat4590

[3 rows x 11 columns]

In [94]:
#.isin()
df[df['day'].isin(['Sat','Sun'])]

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0         16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1         10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2         21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3         23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4         24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251
..          ...   ...     ...  ...                 ...               ...        ...
238       35.83  4.67  Female  ...      Kimberly Crane      676184013727    Sat9777
239       29.03  5.92    Male  ...       Michael Avila  5296068606052842    Sat2657
240       27.18  2.00  Female  ...      Monica Sanders  3506806155565404    Sat1766
241       22.67  2.00    Male  ...          Keith Wong  6011891618747196    Sat3880
242       17.82  1.75    Male  ...        Dennis Dixon     4375220550950      Sat17

[163 rows x 11 columns]

## Missing Data

In [95]:
np.nan # float data , None for object_dtype

nan

In [96]:
pd.NA

In [97]:
pd.NaT # datetime_like data

NaT

In [98]:
np.nan == np.nan

False

In [99]:
np.nan in [np.nan]

True

In [100]:
np.nan is np.nan

True

In [101]:
pd.NA == pd.NA

In [102]:
df = pd.read_csv('sample_data/movie_scores.csv')
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [103]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [104]:
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [105]:
df['first_name']

0      Tom
1      NaN
2     Hugh
3    Oprah
4     Emma
Name: first_name, dtype: object

In [106]:
df[df['first_name'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [107]:
df[(df['pre_movie_score'].isnull()) & df['sex'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

In [108]:
# drop data
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [109]:
df.dropna(thresh=1)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [110]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [111]:
df.dropna(thresh=4, axis=1)

  first_name last_name   age  sex
0        Tom     Hanks  63.0    m
1        NaN       NaN   NaN  NaN
2       Hugh   Jackman  51.0    m
3      Oprah   Winfrey  66.0    f
4       Emma     Stone  31.0    f

In [112]:
# fill data
df.fillna('New Value')

  first_name  last_name        age        sex pre_movie_score post_movie_score
0        Tom      Hanks         63          m               8               10
1  New Value  New Value  New Value  New Value       New Value        New Value
2       Hugh    Jackman         51          m       New Value        New Value
3      Oprah    Winfrey         66          f               6                8
4       Emma      Stone         31          f               7                9

In [113]:
df['first_name'].fillna('Some_name')

0          Tom
1    Some_name
2         Hugh
3        Oprah
4         Emma
Name: first_name, dtype: object

In [114]:
df['pre_movie_score'].mean()

7.0

In [116]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean()) # filling with mean score

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [117]:
df.fillna(df.mean())

  first_name last_name    age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.00    m              8.0              10.0
1        NaN       NaN  52.75  NaN              7.0               9.0
2       Hugh   Jackman  51.00    m              7.0               9.0
3      Oprah   Winfrey  66.00    f              6.0               8.0
4       Emma     Stone  31.00    f              7.0               9.0

In [118]:
# filling with interpolation
data = {'first':100, 'second':np.nan, 'third':50,'fourth':40}
data = pd.Series(data)
data

first     100.0
second      NaN
third      50.0
fourth     40.0
dtype: float64

In [119]:
data.interpolate() # default method is 'linear'.

first     100.0
second     75.0
third      50.0
fourth     40.0
dtype: float64

In [121]:
df = pd.DataFrame(data, columns = ['Number'])
df

        Number
first    100.0
second     NaN
third     50.0
fourth    40.0

In [122]:
df = df.reset_index()
df

    index  Number
0   first   100.0
1  second     NaN
2   third    50.0
3  fourth    40.0

In [124]:
df.interpolate(method='spline', order=2)

    index  Number
0   first   100.0
1  second    70.0
2   third    50.0
3  fourth    40.0

In [127]:
help(df.interpolate)

Help on method interpolate in module pandas.core.generic:

interpolate(method: str = 'linear', axis: Union[str, int] = 0, limit: Union[int, NoneType] = None, inplace: bool = False, limit_direction: Union[str, NoneType] = None, limit_area: Union[str, NoneType] = None, downcast: Union[str, NoneType] = None, **kwargs) -> Union[~FrameOrSeries, NoneType] method of pandas.core.frame.DataFrame instance
    Please note that only ``method='linear'`` is supported for
    DataFrame/Series with a MultiIndex.

    Parameters
    ----------
    method : str, default 'linear'
        Interpolation technique to use. One of:

        * 'linear': Ignore the index and treat the values as equally
          spaced. This is the only method supported on MultiIndexes.
        * 'time': Works on daily and higher resolution data to interpolate
          given length of interval.
        * 'index', 'values': use the actual numerical values of the index.
        * 'pad': Fill in NaNs using existing values.
        * 'nearest', 'zero', 'slinear', 'quadratic', 'cubic', 'spline',
          'barycentric', 'polynomial': Passed to
          `scipy.interpolate.interp1d`. These methods use the numerical
          values of the index.  Both 'polynomial' and 'spline' require that
          you also specify an `order` (int), e.g.
          ``df.interpolate(method='polynomial', order=5)``.
        * 'krogh', 'piecewise_polynomial', 'spline', 'pchip', 'akima',
          'cubicspline': Wrappers around the SciPy interpolation methods of
          similar names. See `Notes`.
        * 'from_derivatives': Refers to
          `scipy.interpolate.BPoly.from_derivatives` which
          replaces 'piecewise_polynomial' interpolation method in
          scipy 0.18.
    axis : {{0 or 'index', 1 or 'columns', None}}, default None
        Axis to interpolate along.
    limit : int, optional
        Maximum number of consecutive NaNs to fill. Must be greater than
        0.
    inplace : bool, default False
        Update the data in place if possible.
    limit_direction : {{'forward', 'backward', 'both'}}, Optional
        Consecutive NaNs will be filled in this direction.

        If limit is specified:
            * If 'method' is 'pad' or 'ffill', 'limit_direction' must be 'forward'.
            * If 'method' is 'backfill' or 'bfill', 'limit_direction' must be
              'backwards'.

        If 'limit' is not specified:
            * If 'method' is 'backfill' or 'bfill', the default is 'backward'
            * else the default is 'forward'

        .. versionchanged:: 1.1.0
            raises ValueError if `limit_direction` is 'forward' or 'both' and
                method is 'backfill' or 'bfill'.
            raises ValueError if `limit_direction` is 'backward' or 'both' and
                method is 'pad' or 'ffill'.

    limit_area : {{`None`, 'inside', 'outside'}}, default None
        If limit is specified, consecutive NaNs will be filled with this
        restriction.

        * ``None``: No fill restriction.
        * 'inside': Only fill NaNs surrounded by valid values
          (interpolate).
        * 'outside': Only fill NaNs outside valid values (extrapolate).

        .. versionadded:: 0.23.0

    downcast : optional, 'infer' or None, defaults to None
        Downcast dtypes if possible.
    **kwargs
        Keyword arguments to pass on to the interpolating function.

    Returns
    -------
    Series or DataFrame
        Returns the same object type as the caller, interpolated at
        some or all ``NaN`` values.

    See Also
    --------
    fillna : Fill missing values using different methods.
    scipy.interpolate.Akima1DInterpolator : Piecewise cubic polynomials
        (Akima interpolator).
    scipy.interpolate.BPoly.from_derivatives : Piecewise polynomial in the
        Bernstein basis.
    scipy.interpolate.interp1d : Interpolate a 1-D function.
    scipy.interpolate.KroghInterpolator : Interpolate polynomial (Krogh
        interpolator).
    scipy.interpolate.PchipInterpolator : PCHIP 1-d monotonic cubic
        interpolation.
    scipy.interpolate.CubicSpline : Cubic spline data interpolator.

    Notes
    -----
    The 'krogh', 'piecewise_polynomial', 'spline', 'pchip' and 'akima'
    methods are wrappers around the respective SciPy implementations of
    similar names. These use the actual numerical values of the index.
    For more information on their behavior, see the
    `SciPy documentation
    <https://docs.scipy.org/doc/scipy/reference/interpolate.html#univariate-interpolation>`__
    and `SciPy tutorial
    <https://docs.scipy.org/doc/scipy/reference/tutorial/interpolate.html>`__.

    Examples
    --------
    Filling in ``NaN`` in a :class:`~pandas.Series` via linear
    interpolation.

    >>> s = pd.Series([0, 1, np.nan, 3])
    >>> s
    0    0.0
    1    1.0
    2    NaN
    3    3.0
    dtype: float64
    >>> s.interpolate()
    0    0.0
    1    1.0
    2    2.0
    3    3.0
    dtype: float64

    Filling in ``NaN`` in a Series by padding, but filling at most two
    consecutive ``NaN`` at a time.

    >>> s = pd.Series([np.nan, "single_one", np.nan,
    ...                "fill_two_more", np.nan, np.nan, np.nan,
    ...                4.71, np.nan])
    >>> s
    0              NaN
    1       single_one
    2              NaN
    3    fill_two_more
    4              NaN
    5              NaN
    6              NaN
    7             4.71
    8              NaN
    dtype: object
    >>> s.interpolate(method='pad', limit=2)
    0              NaN
    1       single_one
    2       single_one
    3    fill_two_more
    4    fill_two_more
    5    fill_two_more
    6              NaN
    7             4.71
    8             4.71
    dtype: object

    Filling in ``NaN`` in a Series via polynomial interpolation or splines:
    Both 'polynomial' and 'spline' methods require that you also specify
    an ``order`` (int).

    >>> s = pd.Series([0, 2, np.nan, 8])
    >>> s.interpolate(method='polynomial', order=2)
    0    0.000000
    1    2.000000
    2    4.666667
    3    8.000000
    dtype: float64

    Fill the DataFrame forward (that is, going down) along each column
    using linear interpolation.

    Note how the last entry in column 'a' is interpolated differently,
    because there is no entry after it to use for interpolation.
    Note how the first entry in column 'b' remains ``NaN``, because there
    is no entry before it to use for interpolation.

    >>> df = pd.DataFrame([(0.0, np.nan, -1.0, 1.0),
    ...                    (np.nan, 2.0, np.nan, np.nan),
    ...                    (2.0, 3.0, np.nan, 9.0),
    ...                    (np.nan, 4.0, -4.0, 16.0)],
    ...                   columns=list('abcd'))
    >>> df
         a    b    c     d
    0  0.0  NaN -1.0   1.0
    1  NaN  2.0  NaN   NaN
    2  2.0  3.0  NaN   9.0
    3  NaN  4.0 -4.0  16.0
    >>> df.interpolate(method='linear', limit_direction='forward', axis=0)
         a    b    c     d
    0  0.0  NaN -1.0   1.0
    1  1.0  2.0 -2.0   5.0
    2  2.0  3.0 -3.0   9.0
    3  2.0  4.0 -4.0  16.0

    Using polynomial interpolation.

    >>> df['d'].interpolate(method='polynomial', order=2)
    0     1.0
    1     4.0
    2     9.0
    3    16.0
    Name: d, dtype: float64

## Inputs and Outputs

<table border="1" class="colwidths-given docutils">
<colgroup>
<col width="12%" />
<col width="40%" />
<col width="24%" />
<col width="24%" />
</colgroup>
<thead valign="bottom">
<tr class="row-odd"><th class="head">Format Type</th>
<th class="head">Data Description</th>
<th class="head">Reader</th>
<th class="head">Writer</th>
</tr>
</thead>
<tbody valign="top">
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Comma-separated_values">CSV</a></td>
<td><a class="reference internal" href="#io-read-csv-table"><span class="std std-ref">read_csv</span></a></td>
<td><a class="reference internal" href="#io-store-in-csv"><span class="std std-ref">to_csv</span></a></td>
</tr>
<tr class="row-odd"><td>text</td>
<td><a class="reference external" href="https://www.json.org/">JSON</a></td>
<td><a class="reference internal" href="#io-json-reader"><span class="std std-ref">read_json</span></a></td>
<td><a class="reference internal" href="#io-json-writer"><span class="std std-ref">to_json</span></a></td>
</tr>
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/HTML">HTML</a></td>
<td><a class="reference internal" href="#io-read-html"><span class="std std-ref">read_html</span></a></td>
<td><a class="reference internal" href="#io-html"><span class="std std-ref">to_html</span></a></td>
</tr>
<tr class="row-odd"><td>text</td>
<td>Local clipboard</td>
<td><a class="reference internal" href="#io-clipboard"><span class="std std-ref">read_clipboard</span></a></td>
<td><a class="reference internal" href="#io-clipboard"><span class="std std-ref">to_clipboard</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Microsoft_Excel">MS Excel</a></td>
<td><a class="reference internal" href="#io-excel-reader"><span class="std std-ref">read_excel</span></a></td>
<td><a class="reference internal" href="#io-excel-writer"><span class="std std-ref">to_excel</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="http://www.opendocumentformat.org">OpenDocument</a></td>
<td><a class="reference internal" href="#io-ods"><span class="std std-ref">read_excel</span></a></td>
<td>&#160;</td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://support.hdfgroup.org/HDF5/whatishdf5.html">HDF5 Format</a></td>
<td><a class="reference internal" href="#io-hdf5"><span class="std std-ref">read_hdf</span></a></td>
<td><a class="reference internal" href="#io-hdf5"><span class="std std-ref">to_hdf</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://github.com/wesm/feather">Feather Format</a></td>
<td><a class="reference internal" href="#io-feather"><span class="std std-ref">read_feather</span></a></td>
<td><a class="reference internal" href="#io-feather"><span class="std std-ref">to_feather</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://parquet.apache.org/">Parquet Format</a></td>
<td><a class="reference internal" href="#io-parquet"><span class="std std-ref">read_parquet</span></a></td>
<td><a class="reference internal" href="#io-parquet"><span class="std std-ref">to_parquet</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://msgpack.org/index.html">Msgpack</a></td>
<td><a class="reference internal" href="#io-msgpack"><span class="std std-ref">read_msgpack</span></a></td>
<td><a class="reference internal" href="#io-msgpack"><span class="std std-ref">to_msgpack</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Stata">Stata</a></td>
<td><a class="reference internal" href="#io-stata-reader"><span class="std std-ref">read_stata</span></a></td>
<td><a class="reference internal" href="#io-stata-writer"><span class="std std-ref">to_stata</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/SAS_(software)">SAS</a></td>
<td><a class="reference internal" href="#io-sas-reader"><span class="std std-ref">read_sas</span></a></td>
<td>&#160;</td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://docs.python.org/3/library/pickle.html">Python Pickle Format</a></td>
<td><a class="reference internal" href="#io-pickle"><span class="std std-ref">read_pickle</span></a></td>
<td><a class="reference internal" href="#io-pickle"><span class="std std-ref">to_pickle</span></a></td>
</tr>
<tr class="row-odd"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/SQL">SQL</a></td>
<td><a class="reference internal" href="#io-sql"><span class="std std-ref">read_sql</span></a></td>
<td><a class="reference internal" href="#io-sql"><span class="std std-ref">to_sql</span></a></td>
</tr>
<tr class="row-even"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/BigQuery">Google Big Query</a></td>
<td><a class="reference internal" href="#io-bigquery"><span class="std std-ref">read_gbq</span></a></td>
<td><a class="reference internal" href="#io-bigquery"><span class="std std-ref">to_gbq</span></a></td>
</tr>
</tbody>
</table>

> pwd = current working directory  
> ls = file lists in that directory

- pd.read_csv('path/file.csv')
- df.to_csv('new_file.csv', index=False)
- pd.read_html('url')
- df.to_html('name.html', index=False)
- pd.read_excel('name.xlsx', sheet_name = 'sheet')
- pd.ExcelFile('name.xlsx').sheet_names # return names of sheets
- df.to_excel('name.xlsx', sheet_name = 'name', index=False)

In [130]:
# MySQL
from sqlalchemy import create_engine

In [131]:
temp_db = create_engine('sqlite:///:memory:')
temp_db

Engine(sqlite:///:memory:)

In [134]:
# Write to db
tables = pd.read_html('https://en.wikipedia.org/wiki/World_population')
tables[6]

   Rank         Country  ...  Density(pop/km2)  Population trend
0     1           India  ...               420           Growing
1     2        Pakistan  ...               280   Rapidly growing
2     3      Bangladesh  ...              1190   Rapidly growing
3     4           Japan  ...               333     Declining[98]
4     5     Philippines  ...               369           Growing
5     6         Vietnam  ...               290           Growing
6     7  United Kingdom  ...               273           Growing
7     8     South Korea  ...               520            Steady
8     9          Taiwan  ...               652            Steady
9    10       Sri Lanka  ...               332           Growing

[10 rows x 6 columns]

In [135]:
tables[6].to_sql(name='populations', con=temp_db)

In [136]:
# read from sql
pd.read_sql(sql='populations', con = temp_db)

   index  Rank         Country  ...  Area(km2)  Density(pop/km2)  Population trend
0      0     1           India  ...    3287240               420           Growing
1      1     2        Pakistan  ...     803940               280   Rapidly growing
2      2     3      Bangladesh  ...     143998              1190   Rapidly growing
3      3     4           Japan  ...     377873               333     Declining[98]
4      4     5     Philippines  ...     300000               369           Growing
5      5     6         Vietnam  ...     331689               290           Growing
6      6     7  United Kingdom  ...     243610               273           Growing
7      7     8     South Korea  ...      99538               520            Steady
8      8     9          Taiwan  ...      36193               652            Steady
9      9    10       Sri Lanka  ...      65610               332           Growing

[10 rows x 7 columns]

In [141]:
# read in with a query
pd.read_sql(sql = "SELECT Country,Population FROM populations WHERE Population > 100000000", con=temp_db)

       Country  Population
0        India  1381950000
1     Pakistan   225000000
2   Bangladesh   171360000
3        Japan   126010000
4  Philippines   110830000